app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page] || 1, per_page: 10)